import { HistoricalDate } from './models/historicalDate';

export const historicalDate: HistoricalDate[] = [
	{
		title: 'Космос',
		id: 1,
		period: { start: 2003, end: 2099 },
		events: [
			{
				year: 2003,
				description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
			},
			{
				year: 203,
				description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
			},
			{
				year: 2004,
				description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
			},
			{
				year: 2005,
				description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
			},
			{
				year: 2007,
				description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
			},
		],
	},
	{
		title: 'Наука',
		id: 2,
		period: { start: 2011, end: 2102 },
		events: [
			{
				year: 2003,
				description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
			},
			{
				year: 200,
				description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
			},
			{
				year: 2003,
				description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
			},
			{
				year: 2003,
				description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
			},
			{
				year: 2003,
				description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
			},
		],
	},
	{
		title: 'Технологии',
		id: 3,
		period: { start: 2014, end: 2312 },
		events: [
			{
				year: 2003,
				description: '1 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
			},
			{
				year: 2003,
				description: '2 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
			},
			{
				year: 2003,
				description: '3 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
			},
			{
				year: 2003,
				description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
			},
			{
				year: 2003,
				description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
			},
		],
	},
	{
		title: 'Фильмы',
		id: 4,
		period: { start: 2002, end: 2001 },
		events: [
			{
				year: 2003,
				description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
			},
			{
				year: 2003,
				description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
			},
			{
				year: 2003,
				description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
			},
			{
				year: 2003,
				description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
			},
			{
				year: 2003,
				description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
			},
		],
	},
	{
		title: 'Театр',
		id: 5,
		period: { start: 1999, end: 2002 },
		events: [
			{
				year: 2003,
				description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
			},
			{
				year: 2003,
				description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
			},
			{
				year: 2003,
				description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
			},
			{
				year: 2003,
				description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
			},
			{
				year: 2003,
				description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
			},
		],
	},
	{
		title: 'Копейск',
		id: 6,
		period: { start: 2024, end: 2000 },
		events: [
			{
				year: 2003,
				description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
			},
			{
				year: 2003,
				description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
			},
			{
				year: 2003,
				description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
			},
			{
				year: 2003,
				description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
			},
			{
				year: 2003,
				description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
			},
		],
	},
];
